# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireMaterialTypeSet..::..ReverseIterator Method
WireMaterialTypeSet Class See Also
---
Retrieve a backward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual WireMaterialTypeSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As WireMaterialTypeSetIterator
```

Visual C++
---
```text
public:
virtual WireMaterialTypeSetIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the set.
# See Also
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace